{"map_features": {
    "building": "To map the building: Press the Area button and trace an area around the outline of the building by clicking on each corner of the building.  Click or press Space to place a starting node on one of the corners of the building. Finally, add the tag 'building=yes' to this feature. Buildings should be traced around their footprint as accurately as possible.",
    "building_josm": "To map the building, select “Draw nodes” tool or keyboard shortcut “A” and trace an area around the outline of the building by clicking on each corner of the building.  Ensure that it loops back on itself to create a closed area. Finally, add the tag “building=yes” to this feature. Buildings should be traced around their footprint as accurately as possible. If you draw a lot of buildings, 'buildings_tools' plugin will make the process faster and easier in JOSM. To know more how to use this plugin to draw buildings, visit: https://learnosm.org/en/josm/josm-more-plugins/#the-buildings-tools-plugin",
    "line": "To map the line features like roads, waterways in id-editor, Press the line button and trace the feature by creating the nodes along the linear feature. When you're finished, click the last node again or press Enter. Finally, add the respective tag.",
    "line_josm": "To map the line features like roads, waterways in JOSM, select 'Draw nodes' tool or keyboard shortcut 'A' and trace the feature by creating the nodes along the linear feature. When you're finished, click the last node again or press Enter. Finally, add the respective tag. If you draw a lot of linear features, 'fast_draw' plugin will make the process faster and easier in JOSM. To know more how to use this plugin to draw buildings, visit: https://wiki.openstreetmap.org/wiki/JOSM/Plugins/FastDraw  ",
    "no_features": " You can create an account at [openstreetmap.org](https://openstreetmap.org) and start editing data using iD editor or other editor of your choice. There is a built-in tutorial in iDeditor. To access it: • Log in or Sign up (on the OpenStreetMap.org homepage). • Start iD (on the OpenStreetMap.org homepage click the 'Edit' button or, if you have set another default editor in your user preferences, click 'iD' inside the 'Edit ▼' menu), • Click the help icon (currently in the right panel, bottom), • Click the big 'Start the Walkthrough' button buttom at the list of help chaptersNote that this is mainly a tutorial to use iD. We also have other editors like JOSM, Potlatch and more. Other tutorials would be Beginners' guide in [Begineers' guide Wiki](https://wiki.openstreetmap.org/wiki/Beginners%27_guide) or [Learn OSM](https://learnosm.org/en/)."
    }}